// 1) Automatic checking - no restart required
"UPDATES_AVAILABLE_NO_RESTART_MESSAGE" = "Software updates are available for your computer. Do you want to install them?";
"UPDATES_AVAILABLE_NO_RESTART_INFORMATIVE" = "You can continue to use your computer during the installation. You don’t need to restart it when the installation is complete.";
"INSTALL_TITLE" = "Install";

// 2) Automatic checking - restart required, already downloaded
"UPDATES_AVAILABLE_INSTALL_MESSAGE" = "Software updates for your computer are ready to be installed. Do you want to install them now?";

"UPDATES_AVAILABLE_INSTALL_AND_RESTART_INFORMATIVE" = "You must restart your computer after the updates are installed.";
"LOG_OUT_AND_INSTALL_AND_RESTART_TITLE" = "Install and Restart";

"UPDATES_AVAILABLE_INSTALL_AND_LOG_OUT_INFORMATIVE" = "You must log out to install the updates.";
"LOG_OUT_AND_INSTALL_TITLE" = "Log Out and Install";

"UPDATES_AVAILABLE_INSTALL_AND_SHUTDOWN_INFORMATIVE" = "You must shut down your computer after the updates are installed.";
"LOG_OUT_AND_INSTALL_AND_SHUTDOWN_TITLE" = "Install and Shut Down";

// 3) Automatic checking - Restart / Log out / Shut Down required, need to download
"UPDATES_AVAILABLE_DOWNLOAD_AND_RESTART_MESSAGE" = "Software updates are available for your computer. Do you want to download and install them?";
"UPDATES_AVAILABLE_DOWNLOAD_AND_RESTART_INFORMATIVE" = "You must restart your computer after the updates are installed.";

"UPDATES_AVAILABLE_DOWNLOAD_AND_LOG_OUT_MESSAGE" = "Software updates are available for your computer. Do you want to download and install them?";
"UPDATES_AVAILABLE_DOWNLOAD_AND_LOG_OUT_INFORMATIVE" = "You must log out after the updates are downloaded.";

"UPDATES_AVAILABLE_DOWNLOAD_AND_SHUTDOWN_MESSAGE" = "Software updates are available for your computer. Do you want to download and install them?";
"UPDATES_AVAILABLE_DOWNLOAD_AND_SHUTDOWN_INFORMATIVE" = "You must shut down your computer after the updates are installed.";

"CONTINUE_TITLE" = "Continue";


// common buttons
"NOT_NOW_TITLE" = "Not Now";
"SHOW_DETAILS_TITLE" = "Show Details";
